In [1]:
import pandas as pd

In [2]:
series = pd.Series([1,2,3,4])

In [3]:
series

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
series = pd.Series([1,2,3,4], index=['a','b','c','d'])

In [5]:
series.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
series.values

array([1, 2, 3, 4])

In [7]:
series['a']

1

In [8]:
series['d']

4

In [9]:
series[['d','a']]

d    4
a    1
dtype: int64

In [10]:
series

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
series[series>2]

c    3
d    4
dtype: int64

In [13]:
series*2

a    2
b    4
c    6
d    8
dtype: int64

In [14]:
series

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
import numpy as np
np.exp(series)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [17]:
'b' in series

True

In [19]:
dictionary = {'punjab':'lahore','sindh':'karachi','pakistan':'islamabad','kpk':'peshawar','balochistan':'quetta'}

In [20]:
series2 = pd.Series(dictionary)

In [21]:
series2

punjab            lahore
sindh            karachi
pakistan       islamabad
kpk             peshawar
balochistan       quetta
dtype: object

In [25]:
states = ['PUNJAB','SINDH','PAKISTAN','KPK','BALOCHISTAN']

In [27]:
sereis2 = pd.Series(dictionary, index =states)

In [28]:
sereis2

PUNJAB         NaN
SINDH          NaN
PAKISTAN       NaN
KPK            NaN
BALOCHISTAN    NaN
dtype: object

In [29]:
pd.isnull(sereis2)

PUNJAB         True
SINDH          True
PAKISTAN       True
KPK            True
BALOCHISTAN    True
dtype: bool

In [30]:
series

a    1
b    2
c    3
d    4
dtype: int64

In [31]:
series2

punjab            lahore
sindh            karachi
pakistan       islamabad
kpk             peshawar
balochistan       quetta
dtype: object

In [32]:
pd.isnull(series2)

punjab         False
sindh          False
pakistan       False
kpk            False
balochistan    False
dtype: bool

In [33]:
dictionary

{'punjab': 'lahore',
 'sindh': 'karachi',
 'pakistan': 'islamabad',
 'kpk': 'peshawar',
 'balochistan': 'quetta'}

In [35]:
series2 = pd.Series(dictionary,index=states)

In [34]:
states = ['punjab','sindh','kpk','pakistan','balochistan','azad-kashmir']

In [36]:
series2

punjab             lahore
sindh             karachi
kpk              peshawar
pakistan        islamabad
balochistan        quetta
azad-kashmir          NaN
dtype: object

In [37]:
series

a    1
b    2
c    3
d    4
dtype: int64

In [38]:
series.name = "dummy"

In [39]:
series

a    1
b    2
c    3
d    4
Name: dummy, dtype: int64

In [40]:
series.index.name = 'label'

In [41]:
series

label
a    1
b    2
c    3
d    4
Name: dummy, dtype: int64

In [43]:
series.index = ['one','two','three','four']

In [44]:
series

one      1
two      2
three    3
four     4
Name: dummy, dtype: int64

In [45]:
pd.__version__

'1.0.1'

In [47]:
series

one      1
two      2
three    3
four     4
Name: dummy, dtype: int64

In [48]:
s1 = pd.Series([1,2,3,4])

In [49]:
s1

0    1
1    2
2    3
3    4
dtype: int64

In [50]:
s1 = pd.Series([1,2,3,4], index = ['a','b','c','d'], dtype=str, name="libraries")

In [51]:
s1

a    1
b    2
c    3
d    4
Name: libraries, dtype: object

In [52]:
s2 = pd.Series(2,index=[0,1,2,3])

In [53]:
s2

0    2
1    2
2    2
3    2
dtype: int64

In [54]:
max(s2)

2

In [55]:
min(s2)

2

In [56]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [57]:
frame = pd.DataFrame(data)

In [58]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [59]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [60]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [61]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [62]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [64]:
data = {'classes':['matric','inter','bsc','mcs'],
       
       'year':[2015,2017,2019,2022],
        'grade':['B','B','A','A']
        }

In [65]:
data

{'classes': ['matric', 'inter', 'bsc', 'mcs'],
 'year': [2015, 2017, 2019, 2022],
 'grade': ['B', 'B', 'A', 'A']}

In [67]:
df1 = pd.DataFrame(data)

In [68]:
df1

  classes  year grade
0  matric  2015     B
1   inter  2017     B
2     bsc  2019     A
3     mcs  2022     A

In [69]:
df1.columns

Index(['classes', 'year', 'grade'], dtype='object')

In [70]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [71]:
df1.values

array([['matric', 2015, 'B'],
       ['inter', 2017, 'B'],
       ['bsc', 2019, 'A'],
       ['mcs', 2022, 'A']], dtype=object)

In [74]:
df1.index.name = "index"

In [75]:
df1

      classes  year grade
index
0      matric  2015     B
1       inter  2017     B
2         bsc  2019     A
3         mcs  2022     A

In [77]:
df1.columns.name="classes"

In [78]:
df1

classes classes  year grade
index
0        matric  2015     B
1         inter  2017     B
2           bsc  2019     A
3           mcs  2022     A

In [79]:
arr = np.arange(12).reshape(3,4)

In [80]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [81]:
df2 = pd.DataFrame(arr)

In [82]:
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [83]:
df2.rename(columns={0:'colors',1:'shapes'},in)

   colors  shapes   2   3
0       0       1   2   3
1       4       5   6   7
2       8       9  10  11

In [84]:
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [87]:
df3 = pd.DataFrame(arr,columns=['shape','color','physics','data'])

In [88]:
df3

   shape  color  physics  data
0      0      1        2     3
1      4      5        6     7
2      8      9       10    11

In [89]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [90]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [91]:
ufo.columns = ufo.columns.str.replace(' ','_')

In [92]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')